import numpy as np


if __name__ == '__main__':
    # axis=0 按列统计，结果为行
    # axis=1 按行统计，结果为列

    nd_arr = np.array([
        [70, 64, 37, 24, 82, 67, 56, 56, 22, 79],
        [12, 22, 10, 37, 83, 42, 95, 36, 16, 62],
        [93, 84, 62, 51, 82, 99, 36, 46, 60, 84]
    ])
    print(nd_arr, end='\n\n')

    """
        ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
        最大值
    """
    print(np.max(nd_arr, axis=0))
    print(np.max(nd_arr, axis=1))
    print(np.max(nd_arr))
    '''
    [93 84 62 51 83 99 95 56 60 84]
    [82 95 99]
    99
    '''

    """
        ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
        最小值
    """
    print(np.min(nd_arr, axis=0))
    print(np.min(nd_arr, axis=1))
    print(np.min(nd_arr))
    '''
    [12 22 10 24 82 42 36 36 16 62]
    [22 10 36]
    10
    '''

    """
        ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
        求和
    """
    print(np.sum(nd_arr, axis=0))
    print(np.sum(nd_arr, axis=1))
    print(np.sum(nd_arr))
    '''
    [175 170 109 112 247 208 187 138  98 225]
    [557 415 697]
    1669
    '''

    """
        ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
        中位数
    """
    print(np.median(nd_arr, axis=0))
    print(np.median(nd_arr, axis=1))
    print(np.median(nd_arr))
    '''
    [70. 64. 37. 37. 82. 67. 56. 46. 22. 79.]
    [60.  36.5 72. ]
    58.0
    '''

    """
        ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
        平均值
    """
    print(np.mean(nd_arr, axis=0, dtype=np.int32))
    print(np.mean(nd_arr, axis=1, dtype=np.int32))
    print(np.mean(nd_arr, dtype=np.int32))
    '''
    [58 56 36 37 82 69 62 46 32 75]
    [55 41 69]
    55
    '''

    """
        ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
        加权平均值
    """
    w = np.array([
        [7, 1, 8, 1, 4, 2, 5, 7, 5, 9],
        [5, 8, 4, 7, 2, 3, 6, 3, 2, 2],
        [7, 3, 6, 6, 6, 6, 2, 1, 8, 9]
    ])  # 每个数据对应的权值
    print(np.average(nd_arr, axis=0, weights=w))
    print(np.average(nd_arr, axis=1, weights=w))
    print(np.average(nd_arr, weights=w))
    '''
    [63.21052632 41.         39.33333333 42.07142857 82.16666667 77.63636364
     70.92307692 49.63636364 41.46666667 79.55      ]
    [57.73469388 39.54761905 74.46296296]
    58.69655172413793
    '''

    """
        ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
        极差（最大-最小）
    """
    print(np.ptp(nd_arr, axis=0))
    print(np.ptp(nd_arr, axis=1))
    print(np.ptp(nd_arr))
    '''
    [81 62 52 27  1 57 59 20 44 22]
    [60 85 63]
    89
    '''

    """
        ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
        方差
    """
    print(np.var(nd_arr, axis=0))
    print(np.var(nd_arr, axis=1))
    print(np.var(nd_arr))
    '''
    [1.16155556e+03 6.67555556e+02 4.50888889e+02 1.21555556e+02
     2.22222222e-01 5.44222222e+02 6.00222222e+02 6.66666667e+01
     3.79555556e+02 8.86666667e+01]
    [412.61 794.85 416.21]
    673.7655555555555
    '''

    """
        ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
        标准差
    """
    print(np.std(nd_arr, axis=0))
    print(np.std(nd_arr, axis=1))
    print(np.std(nd_arr))
    '''
    [34.08160142 25.8370965  21.23414441 11.02522361  0.47140452 23.32857094
     24.4994331   8.16496581 19.48218559  9.41629793]
    [20.31280384 28.19308426 20.40122545]
    25.956994347488607
    '''
